In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import statistics as stat

In [2]:
data=pd.read_csv(r'C:\Users\nithin padmanabhan\Downloads\StudentsPerformance.csv')

In [3]:
data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33

In [4]:
data.describe()

        math score  reading score  writing score
count  1000.000000    1000.000000    1000.000000
mean     66.001000      69.195000      68.119000
std      15.569567      14.706436      15.226381
min       0.000000      17.000000      10.000000
25%      57.000000      59.000000      58.000000
50%      66.000000      70.000000      69.000000
75%      77.000000      79.250000      79.000000
max     100.000000     100.000000     100.000000

In [5]:
data.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

Find out how many males and females participated in the test.

In [6]:
data['gender'].value_counts()['male']

482

In [7]:
data['gender'].value_counts()['female']

518

What do you think about the students' parental level of education

In [ ]:
sns.histplot(data['parental level of education'])
plt.title('comparison of parential education')
plt.xlabel('degree')
plt.ylabel('count')
plt.show()

Who scores the most on average for math, reading and writing based on
● Gender
● Test preparation course

In [ ]:
data['math score'].average()